# Terraform environment prod
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
module.app_configuration.data.azurerm_resource_group.hub: Reading...
data.azurerm_private_dns_zone.blob_storage: Reading...
data.azurerm_private_dns_zone.hub_service_bus: Reading...
data.azurerm_private_dns_zone.key_vault: Reading...
data.azurerm_virtual_network.hub_vnet: Reading...
data.azurerm_virtual_network.hub_vnet: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/virtualNetworks/vnetaltinnauth001hub]
module.app_configuration.data.azurerm_resource_group.hub: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]
data.azurerm_private_dns_zone.blob_storage: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net]
data.azurerm_private_dns_zone.key_vault: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net]
data.azurerm_private_dns_zone.hub_service_bus: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.servicebus.windows.net]
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wM2UwZWQzYi04NDQ3LTQyMGEtOTQyOS01NWU4MTNjNjRiMDU7b2JqZWN0SWQ9YTk1ODVhNjQtMjBmMC00ZDE4LWFiYTYtOTkzMGY5MmI4MDljO3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # azurerm_log_analytics_workspace.telemetry has been deleted
  - resource "azurerm_log_analytics_workspace" "telemetry" {
      - id                                      = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001tt02/providers/Microsoft.OperationalInsights/workspaces/logaltinnauth001tt02" -> null
        name                                    = "logaltinnauth001tt02"
        # (15 unchanged attributes hidden)
    }

  # azurerm_resource_group.spoke has been deleted
  - resource "azurerm_resource_group" "spoke" {
        id         = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001tt02"
      - location   = "norwayeast" -> null
      - name       = "rgaltinnauth001tt02" -> null
        tags       = {
            "CreatedAt"   = "Tuesday, 02-Jan-18 23:12:01 UTC"
            "Environment" = "tt02"
            "Instance"    = "001"
            "ProductName" = "auth"
        }
        # (1 unchanged attribute hidden)
    }

  # azurerm_subnet.dual_stack["Default"] has been deleted
  - resource "azurerm_subnet" "dual_stack" {
      - id                                            = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001tt02/providers/Microsoft.Network/virtualNetworks/vnetdsaltinnauth001tt02/subnets/Default" -> null
        name                                          = "Default"
        # (6 unchanged attributes hidden)
    }

  # azurerm_subnet.dual_stack["ServiceBus"] has been deleted
  - resource "azurerm_subnet" "dual_stack" {
      - id                                            = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001tt02/providers/Microsoft.Network/virtualNetworks/vnetdsaltinnauth001tt02/subnets/ServiceBus" -> null
        name                                          = "ServiceBus"
        # (6 unchanged attributes hidden)
    }

  # azurerm_user_assigned_identity.admin has been deleted
  - resource "azurerm_user_assigned_identity" "admin" {
      - id                  = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001tt02/providers/Microsoft.ManagedIdentity/userAssignedIdentities/mipgsqladminaltinnauth001tt02" -> null
        name                = "mipgsqladminaltinnauth001tt02"
      - principal_id        = "b988257f-632d-4ddc-910b-f281cd9c3280" -> null
        tags                = {
            "CreatedAt"   = "Tuesday, 02-Jan-18 23:12:01 UTC"
            "Environment" = "tt02"
            "Instance"    = "001"
            "ProductName" = "auth"
        }
        # (4 unchanged attributes hidden)
    }

  # azurerm_virtual_network.dual_stack has been deleted
  - resource "azurerm_virtual_network" "dual_stack" {
      - id                             = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001tt02/providers/Microsoft.Network/virtualNetworks/vnetdsaltinnauth001tt02" -> null
      - name                           = "vnetdsaltinnauth001tt02" -> null
        tags                           = {
            "CreatedAt"   = "Tuesday, 02-Jan-18 23:12:01 UTC"
            "Environment" = "tt02"
            "Instance"    = "001"
            "ProductName" = "auth"
        }
        # (10 unchanged attributes hidden)
    }

  # azurerm_virtual_network.single_stack has been deleted
  - resource "azurerm_virtual_network" "single_stack" {
      - id                             = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001tt02/providers/Microsoft.Network/virtualNetworks/vnetssaltinnauth001tt02" -> null
      - name                           = "vnetssaltinnauth001tt02" -> null
        tags                           = {
            "CreatedAt"   = "Tuesday, 02-Jan-18 23:12:01 UTC"
            "Environment" = "tt02"
            "Instance"    = "001"
            "ProductName" = "auth"
        }
        # (10 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_application_insights.telemetry will be created
  + resource "azurerm_application_insights" "telemetry" {
      + app_id                              = (known after apply)
      + application_type                    = "web"
      + connection_string                   = (sensitive value)
      + daily_data_cap_in_gb                = 100
      + disable_ip_masking                  = false
      + force_customer_storage_for_profiler = false
      + id                                  = (known after apply)
      + instrumentation_key                 = (sensitive value)
      + internet_ingestion_enabled          = true
      + internet_query_enabled              = true
      + local_authentication_disabled       = false
      + location                            = "norwayeast"
      + name                                = "aialtinnauth001prod"
      + resource_group_name                 = "rgaltinnauth001prod"
      + retention_in_days                   = 90
      + sampling_percentage                 = 100
      + workspace_id                        = (known after apply)
    }

  # azurerm_federated_identity_credential.admin will be created
  + resource "azurerm_federated_identity_credential" "admin" {
      + audience            = [
          + "api://AzureADTokenExchange",
        ]
      + id                  = (known after apply)
      + issuer              = "https://token.actions.githubusercontent.com"
      + name                = "GitHubAction"
      + parent_id           = (known after apply)
      + resource_group_name = "rgaltinnauth001prod"
      + subject             = "repo:Altinn/altinn-authorization-tmp:environment:prod"
    }

  # azurerm_key_vault.key_vault will be created
  + resource "azurerm_key_vault" "key_vault" {
      + access_policy                 = (known after apply)
      + enable_rbac_authorization     = true
      + id                            = (known after apply)
      + location                      = "norwayeast"
      + name                          = "kvaltinnauth001prod"
      + public_network_access_enabled = false
      + purge_protection_enabled      = false
      + resource_group_name           = "rgaltinnauth001prod"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 90
      + tags                          = {
          + "CreatedAt"   = "Tuesday, 02-Jan-18 23:12:01 UTC"
          + "Environment" = "prod"
          + "Instance"    = "001"
          + "ProductName" = "auth"
        }
      + tenant_id                     = "cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c"
      + vault_uri                     = (known after apply)

      + contact (known after apply)

      + network_acls (known after apply)
    }

  # azurerm_log_analytics_workspace.telemetry will be created
  + resource "azurerm_log_analytics_workspace" "telemetry" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "norwayeast"
      + name                            = "logaltinnauth001prod"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "rgaltinnauth001prod"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + workspace_id                    = (known after apply)
    }

  # azurerm_private_endpoint.blob will be created
  + resource "azurerm_private_endpoint" "blob" {
      + custom_dns_configs            = (known after apply)
      + custom_network_interface_name = "nicstblobaltinnauth001prod"
      + id                            = (known after apply)
      + location                      = "norwayeast"
      + name                          = "pepstblobaltinnauth001prod"
      + network_interface             = (known after apply)
      + private_dns_zone_configs      = (known after apply)
      + resource_group_name           = "rgaltinnauth001prod"
      + subnet_id                     = (known after apply)
      + tags                          = {
          + "CreatedAt"   = "Tuesday, 02-Jan-18 23:12:01 UTC"
          + "Environment" = "prod"
          + "Instance"    = "001"
          + "ProductName" = "auth"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "staltinnauth001prod"
          + private_dns_zone_ids = [
              + "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "staltinnauth001prod"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # azurerm_private_endpoint.key_vault will be created
  + resource "azurerm_private_endpoint" "key_vault" {
      + custom_dns_configs            = (known after apply)
      + custom_network_interface_name = "nickvaltinnauth001prod"
      + id                            = (known after apply)
      + location                      = "norwayeast"
      + name                          = "pepkvaltinnauth001prod"
      + network_interface             = (known after apply)
      + private_dns_zone_configs      = (known after apply)
      + resource_group_name           = "rgaltinnauth001prod"
      + subnet_id                     = (known after apply)
      + tags                          = {
          + "CreatedAt"   = "Tuesday, 02-Jan-18 23:12:01 UTC"
          + "Environment" = "prod"
          + "Instance"    = "001"
          + "ProductName" = "auth"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "privatelink.vaultcore.azure.net"
          + private_dns_zone_ids = [
              + "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "kvaltinnauth001prod"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "vault",
            ]
        }
    }

  # azurerm_private_endpoint.service_bus_private_endpoint[0] will be created
  + resource "azurerm_private_endpoint" "service_bus_private_endpoint" {
      + custom_dns_configs            = (known after apply)
      + custom_network_interface_name = "nicsbsbaltinnauth001prod"
      + id                            = (known after apply)
      + location                      = "norwayeast"
      + name                          = "pesbaltinnauth001prod"
      + network_interface             = (known after apply)
      + private_dns_zone_configs      = (known after apply)
      + resource_group_name           = "rgaltinnauth001prod"
      + subnet_id                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "sbaltinnauth001prod"
          + private_dns_zone_ids = [
              + "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.servicebus.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "sbaltinnauth001prod"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "namespace",
            ]
        }
    }

  # azurerm_resource_group.spoke will be created
  + resource "azurerm_resource_group" "spoke" {
      + id       = (known after apply)
      + location = "norwayeast"
      + name     = "rgaltinnauth001prod"
      + tags     = {
          + "CreatedAt"   = "Tuesday, 02-Jan-18 23:12:01 UTC"
          + "Environment" = "prod"
          + "Instance"    = "001"
          + "ProductName" = "auth"
        }
    }

  # azurerm_role_assignment.key_vault_administrator will be created
  + resource "azurerm_role_assignment" "key_vault_administrator" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Administrator"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_route_table.forced_tunneling will be created
  + resource "azurerm_route_table" "forced_tunneling" {
      + bgp_route_propagation_enabled = true
      + id                            = (known after apply)
      + location                      = "norwayeast"
      + name                          = "rtftaltinnauth001prod"
      + resource_group_name           = "rgaltinnauth001prod"
      + route                         = [
          + {
              + address_prefix         = "0.0.0.0/0"
              + name                   = "IPv4ForcedTunneling"
              + next_hop_in_ip_address = "10.202.19.4"
              + next_hop_type          = "VirtualAppliance"
            },
        ]
      + subnets                       = (known after apply)
    }

  # azurerm_servicebus_namespace.service_bus will be created
  + resource "azurerm_servicebus_namespace" "service_bus" {
      + capacity                            = 1
      + default_primary_connection_string   = (sensitive value)
      + default_primary_key                 = (sensitive value)
      + default_secondary_connection_string = (sensitive value)
      + default_secondary_key               = (sensitive value)
      + endpoint                            = (known after apply)
      + id                                  = (known after apply)
      + local_auth_enabled                  = false
      + location                            = "norwayeast"
      + minimum_tls_version                 = "1.2"
      + name                                = "sbaltinnauth001prod"
      + premium_messaging_partitions        = 1
      + public_network_access_enabled       = true
      + resource_group_name                 = "rgaltinnauth001prod"
      + sku                                 = "Premium"
      + tags                                = {
          + "CreatedAt"   = "Tuesday, 02-Jan-18 23:12:01 UTC"
          + "Environment" = "prod"
          + "Instance"    = "001"
          + "ProductName" = "auth"
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + network_rule_set {
          + default_action                = "Deny"
          + ip_rules                      = [
              + "51.120.88.253",
            ]
          + public_network_access_enabled = false
          + trusted_services_allowed      = true
        }
    }

  # azurerm_storage_account.storage will be created
  + resource "azurerm_storage_account" "storage" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "GRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "norwayeast"
      + min_tls_version                    = "TLS1_2"
      + name                               = "staltinnauth001prod"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "rgaltinnauth001prod"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "CreatedAt"   = "Tuesday, 02-Jan-18 23:12:01 UTC"
          + "Environment" = "prod"
          + "Instance"    = "001"
          + "ProductName" = "auth"
        }

      + blob_properties (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + network_rules (known after apply)

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)

      + static_website (known after apply)
    }

  # azurerm_subnet.dual_stack["Default"] will be created
  + resource "azurerm_subnet" "dual_stack" {
      + address_prefixes                              = [
          + "10.202.240.0/22",
          + "fd0a:7204:c37f:700::/64",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "Default"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rgaltinnauth001prod"
      + virtual_network_name                          = "vnetdsaltinnauth001prod"
    }

  # azurerm_subnet.dual_stack["ServiceBus"] will be created
  + resource "azurerm_subnet" "dual_stack" {
      + address_prefixes                              = [
          + "10.202.244.0/25",
          + "fd0a:7204:c37f:701::/64",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "ServiceBus"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rgaltinnauth001prod"
      + virtual_network_name                          = "vnetdsaltinnauth001prod"
    }

  # azurerm_subnet.single_stack["Postgres"] will be created
  + resource "azurerm_subnet" "single_stack" {
      + address_prefixes                              = [
          + "10.202.224.0/22",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "Postgres"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rgaltinnauth001prod"
      + service_endpoints                             = [
          + "Microsoft.Storage",
        ]
      + virtual_network_name                          = "vnetssaltinnauth001prod"

      + delegation {
          + name = "fs"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                ]
              + name    = "Microsoft.DBforPostgreSQL/flexibleServers"
            }
        }
    }

  # azurerm_user_assigned_identity.admin will be created
  + resource "azurerm_user_assigned_identity" "admin" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "norwayeast"
      + name                = "mipgsqladminaltinnauth001prod"
      + principal_id        = (known after apply)
      + resource_group_name = "rgaltinnauth001prod"
      + tags                = {
          + "CreatedAt"   = "Tuesday, 02-Jan-18 23:12:01 UTC"
          + "Environment" = "prod"
          + "Instance"    = "001"
          + "ProductName" = "auth"
        }
      + tenant_id           = (known after apply)
    }

  # azurerm_virtual_network.dual_stack will be created
  + resource "azurerm_virtual_network" "dual_stack" {
      + address_space                  = [
          + "10.202.240.0/20",
          + "fd0a:7204:c37f:700::/56",
        ]
      + dns_servers                    = [
          + "10.202.19.4",
        ]
      + guid                           = (known after apply)
      + id                             = (known after apply)
      + location                       = "norwayeast"
      + name                           = "vnetdsaltinnauth001prod"
      + private_endpoint_vnet_policies = "Disabled"
      + resource_group_name            = "rgaltinnauth001prod"
      + subnet                         = (known after apply)
      + tags                           = {
          + "CreatedAt"   = "Tuesday, 02-Jan-18 23:12:01 UTC"
          + "Environment" = "prod"
          + "Instance"    = "001"
          + "ProductName" = "auth"
        }
    }

  # azurerm_virtual_network.single_stack will be created
  + resource "azurerm_virtual_network" "single_stack" {
      + address_space                  = [
          + "10.202.224.0/21",
        ]
      + dns_servers                    = [
          + "10.202.19.4",
        ]
      + guid                           = (known after apply)
      + id                             = (known after apply)
      + location                       = "norwayeast"
      + name                           = "vnetssaltinnauth001prod"
      + private_endpoint_vnet_policies = "Disabled"
      + resource_group_name            = "rgaltinnauth001prod"
      + subnet                         = (known after apply)
      + tags                           = {
          + "CreatedAt"   = "Tuesday, 02-Jan-18 23:12:01 UTC"
          + "Environment" = "prod"
          + "Instance"    = "001"
          + "ProductName" = "auth"
        }
    }

  # azurerm_virtual_network_peering.hub_to_spoke_dual_stack will be created
  + resource "azurerm_virtual_network_peering" "hub_to_spoke_dual_stack" {
      + allow_forwarded_traffic                = true
      + allow_gateway_transit                  = true
      + allow_virtual_network_access           = true
      + id                                     = (known after apply)
      + name                                   = "spoke-dual-stack-prod"
      + peer_complete_virtual_networks_enabled = true
      + remote_virtual_network_id              = (known after apply)
      + resource_group_name                    = "rgaltinnauth001hub"
      + use_remote_gateways                    = false
      + virtual_network_name                   = "vnetaltinnauth001hub"
    }

  # azurerm_virtual_network_peering.hub_to_spoke_single_stack will be created
  + resource "azurerm_virtual_network_peering" "hub_to_spoke_single_stack" {
      + allow_forwarded_traffic                = true
      + allow_gateway_transit                  = true
      + allow_virtual_network_access           = true
      + id                                     = (known after apply)
      + name                                   = "spoke-single-stack-prod"
      + peer_complete_virtual_networks_enabled = true
      + remote_virtual_network_id              = (known after apply)
      + resource_group_name                    = "rgaltinnauth001hub"
      + use_remote_gateways                    = false
      + virtual_network_name                   = "vnetaltinnauth001hub"
    }

  # azurerm_virtual_network_peering.spoke_to_hub_dual_stack will be created
  + resource "azurerm_virtual_network_peering" "spoke_to_hub_dual_stack" {
      + allow_forwarded_traffic                = true
      + allow_gateway_transit                  = false
      + allow_virtual_network_access           = true
      + id                                     = (known after apply)
      + name                                   = "hub"
      + peer_complete_virtual_networks_enabled = true
      + remote_virtual_network_id              = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/virtualNetworks/vnetaltinnauth001hub"
      + resource_group_name                    = "rgaltinnauth001prod"
      + use_remote_gateways                    = true
      + virtual_network_name                   = "vnetdsaltinnauth001prod"
    }

  # azurerm_virtual_network_peering.spoke_to_hub_single_stack will be created
  + resource "azurerm_virtual_network_peering" "spoke_to_hub_single_stack" {
      + allow_forwarded_traffic                = true
      + allow_gateway_transit                  = false
      + allow_virtual_network_access           = true
      + id                                     = (known after apply)
      + name                                   = "hub"
      + peer_complete_virtual_networks_enabled = true
      + remote_virtual_network_id              = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/virtualNetworks/vnetaltinnauth001hub"
      + resource_group_name                    = "rgaltinnauth001prod"
      + use_remote_gateways                    = true
      + virtual_network_name                   = "vnetssaltinnauth001prod"
    }

Plan: 22 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @andreasisnes |
| Action | `workflow_dispatch` |
| Working Directory | `infra/deploy/spoke` |
| State File | `github.com/altinn/altinn-authorization-tmp/environments/prod/spokes.tfstate` |
| Plan File | `github.com_altinn_altinn-authorization-tmp_environments_prod_spokes.tfstate.tfplan`